# CLI Tools
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zsh"
brew "git"
brew "lazygit"
brew "eza"
brew "bat"
brew "zoxide"
brew "starship"
brew "node"
brew "tree-sitter-cli"

# Programming Languages
brew "go"
brew "gopls"
brew "rust"

# Docker Tools
brew "lazydocker"
brew "dive"
brew "hadolint"

# Applications
cask "ghostty"
cask "wezterm"
cask "docker"

# Fonts (Nerd Fonts for terminal icons)
cask "font-mononoki-nerd-font"

# Language server
brew "rust-analyzer"
