# CLI Tools
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "zsh"
brew "git"
brew "lazygit"
brew "eza"
brew "bat"
brew "zoxide"
brew "starship"
brew "node"

# Applications
cask "wezterm"

# Fonts (Nerd Fonts for terminal icons)
cask "font-mononoki-nerd-font"
